Still getting the same error:

```
2025-06-26T13:00:24.902+0100 [INFO]  Terraform version: 1.2.0
2025-06-26T13:00:24.902+0100 [DEBUG] using github.com/hashicorp/go-tfe v1.0.0
2025-06-26T13:00:24.902+0100 [DEBUG] using github.com/hashicorp/hcl/v2 v2.12.0
2025-06-26T13:00:24.902+0100 [DEBUG] using github.com/hashicorp/terraform-config-inspect v0.0.0-20210209133302-4fd17a0faac2
2025-06-26T13:00:24.902+0100 [DEBUG] using github.com/hashicorp/terraform-svchost v0.0.0-20200729002733-f050f53b9734
2025-06-26T13:00:24.902+0100 [DEBUG] using github.com/zclconf/go-cty v1.10.0
2025-06-26T13:00:24.902+0100 [INFO]  Go runtime version: go1.18.1
2025-06-26T13:00:24.902+0100 [INFO]  CLI args: []string{"/home/al/.tfenv/versions/1.2.0/terraform", "apply", "-auto-approve"}
2025-06-26T13:00:24.902+0100 [DEBUG] Attempting to open CLI config file: /home/al/.terraformrc
2025-06-26T13:00:24.902+0100 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2025-06-26T13:00:24.902+0100 [INFO]  Loading CLI configuration from /home/al/.terraform.d/credentials.tfrc.json
2025-06-26T13:00:24.902+0100 [DEBUG] checking for credentials in "/home/al/.terraform.d/plugins"
2025-06-26T13:00:24.902+0100 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2025-06-26T13:00:24.902+0100 [DEBUG] will search for provider plugins in /home/al/.terraform.d/plugins
2025-06-26T13:00:24.902+0100 [DEBUG] ignoring non-existing provider search directory /home/al/.local/share/terraform/plugins
2025-06-26T13:00:24.902+0100 [DEBUG] ignoring non-existing provider search directory /usr/share/ubuntu/terraform/plugins
2025-06-26T13:00:24.902+0100 [DEBUG] ignoring non-existing provider search directory /usr/share/gnome/terraform/plugins
2025-06-26T13:00:24.902+0100 [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2025-06-26T13:00:24.902+0100 [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2025-06-26T13:00:24.902+0100 [DEBUG] ignoring non-existing provider search directory /var/lib/snapd/desktop/terraform/plugins
2025-06-26T13:00:24.902+0100 [INFO]  CLI command args: []string{"apply", "-auto-approve"}
2025-06-26T13:00:24.903+0100 [DEBUG] New state was assigned lineage "825802a8-94b1-7bef-11ce-a2a8b5af60c6"
2025-06-26T13:00:24.944+0100 [DEBUG] checking for provisioner in "."
2025-06-26T13:00:24.944+0100 [DEBUG] checking for provisioner in "/home/al/.tfenv/versions/1.2.0"
2025-06-26T13:00:24.944+0100 [DEBUG] checking for provisioner in "/home/al/.terraform.d/plugins"
2025-06-26T13:00:24.944+0100 [INFO]  backend/local: starting Apply operation
2025-06-26T13:00:24.945+0100 [DEBUG] created provider logger: level=debug
2025-06-26T13:00:24.945+0100 [INFO]  provider: configuring client automatic mTLS
2025-06-26T13:00:24.958+0100 [DEBUG] provider: starting plugin: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman args=[.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman]
2025-06-26T13:00:24.958+0100 [DEBUG] provider: plugin started: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman pid=50350
2025-06-26T13:00:24.958+0100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman
2025-06-26T13:00:24.963+0100 [INFO]  provider.terraform-provider-hostman: configuring server automatic mTLS: timestamp=2025-06-26T13:00:24.963+0100
2025-06-26T13:00:24.970+0100 [DEBUG] provider.terraform-provider-hostman: plugin address: address=/tmp/plugin619202328 network=unix timestamp=2025-06-26T13:00:24.970+0100
2025-06-26T13:00:24.970+0100 [DEBUG] provider: using plugin: version=5
2025-06-26T13:00:24.984+0100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2025-06-26T13:00:24.986+0100 [DEBUG] provider: plugin process exited: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman pid=50350
2025-06-26T13:00:24.986+0100 [DEBUG] provider: plugin exited
2025-06-26T13:00:24.986+0100 [DEBUG] Building and walking validate graph
2025-06-26T13:00:24.986+0100 [DEBUG] ProviderTransformer: "hostman_kubernetes.main" (*terraform.NodeValidatableResource) needs provider["local/hostman/hostman"]
2025-06-26T13:00:24.986+0100 [DEBUG] ReferenceTransformer: "hostman_kubernetes.main" references: [var.cluster_name var.node_count var.node_type var.availability_zone var.kubernetes_version]
2025-06-26T13:00:24.986+0100 [DEBUG] ReferenceTransformer: "output.cluster_id" references: [hostman_kubernetes.main]
2025-06-26T13:00:24.986+0100 [DEBUG] ReferenceTransformer: "output.cluster_endpoint" references: [hostman_kubernetes.main]
2025-06-26T13:00:24.986+0100 [DEBUG] ReferenceTransformer: "output.cluster_status" references: [hostman_kubernetes.main]
2025-06-26T13:00:24.986+0100 [DEBUG] ReferenceTransformer: "var.kubernetes_version" references: []
2025-06-26T13:00:24.986+0100 [DEBUG] ReferenceTransformer: "output.kubeconfig" references: [hostman_kubernetes.main]
2025-06-26T13:00:24.986+0100 [DEBUG] ReferenceTransformer: "provider[\"local/hostman/hostman\"]" references: [var.hostman_token]
2025-06-26T13:00:24.986+0100 [DEBUG] ReferenceTransformer: "var.node_type" references: []
2025-06-26T13:00:24.986+0100 [DEBUG] ReferenceTransformer: "var.availability_zone" references: []
2025-06-26T13:00:24.986+0100 [DEBUG] ReferenceTransformer: "var.hostman_token" references: []
2025-06-26T13:00:24.986+0100 [DEBUG] ReferenceTransformer: "var.cluster_name" references: []
2025-06-26T13:00:24.986+0100 [DEBUG] ReferenceTransformer: "var.node_count" references: []
2025-06-26T13:00:24.986+0100 [DEBUG] Starting graph walk: walkValidate
2025-06-26T13:00:24.987+0100 [DEBUG] created provider logger: level=debug
2025-06-26T13:00:24.987+0100 [INFO]  provider: configuring client automatic mTLS
2025-06-26T13:00:25.000+0100 [DEBUG] provider: starting plugin: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman args=[.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman]
2025-06-26T13:00:25.000+0100 [DEBUG] provider: plugin started: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman pid=50362
2025-06-26T13:00:25.000+0100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman
2025-06-26T13:00:25.005+0100 [INFO]  provider.terraform-provider-hostman: configuring server automatic mTLS: timestamp=2025-06-26T13:00:25.005+0100
2025-06-26T13:00:25.012+0100 [DEBUG] provider: using plugin: version=5
2025-06-26T13:00:25.012+0100 [DEBUG] provider.terraform-provider-hostman: plugin address: address=/tmp/plugin88306147 network=unix timestamp=2025-06-26T13:00:25.012+0100
2025-06-26T13:00:25.028+0100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2025-06-26T13:00:25.029+0100 [DEBUG] provider: plugin process exited: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman pid=50362
2025-06-26T13:00:25.029+0100 [DEBUG] provider: plugin exited
2025-06-26T13:00:25.029+0100 [INFO]  backend/local: apply calling Plan
2025-06-26T13:00:25.029+0100 [DEBUG] Building and walking plan graph for NormalMode
2025-06-26T13:00:25.029+0100 [DEBUG] ProviderTransformer: "hostman_kubernetes.main (expand)" (*terraform.nodeExpandPlannableResource) needs provider["local/hostman/hostman"]
2025-06-26T13:00:25.029+0100 [DEBUG] ReferenceTransformer: "output.cluster_endpoint" references: [hostman_kubernetes.main (expand)]
2025-06-26T13:00:25.029+0100 [DEBUG] ReferenceTransformer: "output.kubeconfig" references: [hostman_kubernetes.main (expand)]
2025-06-26T13:00:25.029+0100 [DEBUG] ReferenceTransformer: "var.hostman_token" references: []
2025-06-26T13:00:25.029+0100 [DEBUG] ReferenceTransformer: "var.cluster_name" references: []
2025-06-26T13:00:25.029+0100 [DEBUG] ReferenceTransformer: "var.node_count" references: []
2025-06-26T13:00:25.029+0100 [DEBUG] ReferenceTransformer: "var.kubernetes_version" references: []
2025-06-26T13:00:25.029+0100 [DEBUG] ReferenceTransformer: "output.cluster_status" references: [hostman_kubernetes.main (expand)]
2025-06-26T13:00:25.029+0100 [DEBUG] ReferenceTransformer: "hostman_kubernetes.main (expand)" references: [var.node_count var.node_type var.availability_zone var.cluster_name var.kubernetes_version]
2025-06-26T13:00:25.029+0100 [DEBUG] ReferenceTransformer: "var.node_type" references: []
2025-06-26T13:00:25.029+0100 [DEBUG] ReferenceTransformer: "var.availability_zone" references: []
2025-06-26T13:00:25.029+0100 [DEBUG] ReferenceTransformer: "output.cluster_id" references: [hostman_kubernetes.main (expand)]
2025-06-26T13:00:25.029+0100 [DEBUG] ReferenceTransformer: "provider[\"local/hostman/hostman\"]" references: [var.hostman_token]
2025-06-26T13:00:25.030+0100 [DEBUG] Starting graph walk: walkPlan
2025-06-26T13:00:25.030+0100 [DEBUG] created provider logger: level=debug
2025-06-26T13:00:25.030+0100 [INFO]  provider: configuring client automatic mTLS
2025-06-26T13:00:25.043+0100 [DEBUG] provider: starting plugin: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman args=[.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman]
2025-06-26T13:00:25.044+0100 [DEBUG] provider: plugin started: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman pid=50374
2025-06-26T13:00:25.044+0100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman
2025-06-26T13:00:25.047+0100 [INFO]  provider.terraform-provider-hostman: configuring server automatic mTLS: timestamp=2025-06-26T13:00:25.047+0100
2025-06-26T13:00:25.055+0100 [DEBUG] provider.terraform-provider-hostman: plugin address: address=/tmp/plugin852731748 network=unix timestamp=2025-06-26T13:00:25.055+0100
2025-06-26T13:00:25.055+0100 [DEBUG] provider: using plugin: version=5
2025-06-26T13:00:25.069+0100 [DEBUG] Resource instance state not found for node "hostman_kubernetes.main", instance hostman_kubernetes.main
2025-06-26T13:00:25.070+0100 [INFO]  ReferenceTransformer: reference not found: "var.cluster_name"
2025-06-26T13:00:25.070+0100 [INFO]  ReferenceTransformer: reference not found: "var.kubernetes_version"
2025-06-26T13:00:25.070+0100 [INFO]  ReferenceTransformer: reference not found: "var.node_count"
2025-06-26T13:00:25.070+0100 [INFO]  ReferenceTransformer: reference not found: "var.node_type"
2025-06-26T13:00:25.070+0100 [INFO]  ReferenceTransformer: reference not found: "var.availability_zone"
2025-06-26T13:00:25.070+0100 [DEBUG] ReferenceTransformer: "hostman_kubernetes.main" references: []
2025-06-26T13:00:25.070+0100 [DEBUG] refresh: hostman_kubernetes.main: no state, so not refreshing
2025-06-26T13:00:25.071+0100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2025-06-26T13:00:25.072+0100 [DEBUG] provider: plugin process exited: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman pid=50374
2025-06-26T13:00:25.072+0100 [DEBUG] provider: plugin exited
2025-06-26T13:00:25.072+0100 [DEBUG] building apply graph to check for errors
2025-06-26T13:00:25.073+0100 [DEBUG] Resource state not found for node "hostman_kubernetes.main", instance hostman_kubernetes.main
2025-06-26T13:00:25.073+0100 [DEBUG] ProviderTransformer: "hostman_kubernetes.main (expand)" (*terraform.nodeExpandApplyableResource) needs provider["local/hostman/hostman"]
2025-06-26T13:00:25.073+0100 [DEBUG] ProviderTransformer: "hostman_kubernetes.main" (*terraform.NodeApplyableResourceInstance) needs provider["local/hostman/hostman"]
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "output.kubeconfig" references: [hostman_kubernetes.main (expand) hostman_kubernetes.main hostman_kubernetes.main]
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "var.cluster_name" references: []
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "var.node_count" references: []
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "var.kubernetes_version" references: []
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "var.availability_zone" references: []
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "output.cluster_endpoint" references: [hostman_kubernetes.main (expand) hostman_kubernetes.main hostman_kubernetes.main]
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "output.cluster_status" references: [hostman_kubernetes.main (expand) hostman_kubernetes.main hostman_kubernetes.main]
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "hostman_kubernetes.main (expand)" references: []
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "var.hostman_token" references: []
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "var.node_type" references: []
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "output.cluster_id" references: [hostman_kubernetes.main (expand) hostman_kubernetes.main hostman_kubernetes.main]
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "hostman_kubernetes.main" references: [var.cluster_name var.node_count var.node_type var.availability_zone var.kubernetes_version]
2025-06-26T13:00:25.073+0100 [DEBUG] ReferenceTransformer: "provider[\"local/hostman/hostman\"]" references: [var.hostman_token]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hostman_kubernetes.main will be created
  + resource "hostman_kubernetes" "main" {
      + availability_zone = "ams-1"
      + cluster_id        = (known after apply)
      + endpoint          = (known after apply)
      + id                = (known after apply)
      + kubeconfig        = (sensitive value)
      + name              = "my-k8s-cluster"
      + node_count        = 3
      + node_type         = "standard"
      + status            = (known after apply)
      + version           = "1.28"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_endpoint = (known after apply)
  + cluster_id       = (known after apply)
  + cluster_status   = (known after apply)
  + kubeconfig       = (sensitive value)
2025-06-26T13:00:25.074+0100 [INFO]  backend/local: apply calling Apply
2025-06-26T13:00:25.074+0100 [DEBUG] Building and walking apply graph for NormalMode plan
2025-06-26T13:00:25.074+0100 [DEBUG] Resource state not found for node "hostman_kubernetes.main", instance hostman_kubernetes.main
2025-06-26T13:00:25.074+0100 [DEBUG] ProviderTransformer: "hostman_kubernetes.main" (*terraform.NodeApplyableResourceInstance) needs provider["local/hostman/hostman"]
2025-06-26T13:00:25.074+0100 [DEBUG] ProviderTransformer: "hostman_kubernetes.main (expand)" (*terraform.nodeExpandApplyableResource) needs provider["local/hostman/hostman"]
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "hostman_kubernetes.main (expand)" references: []
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "var.cluster_name" references: []
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "var.kubernetes_version" references: []
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "var.node_type" references: []
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "var.availability_zone" references: []
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "output.cluster_endpoint" references: [hostman_kubernetes.main (expand) hostman_kubernetes.main hostman_kubernetes.main]
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "output.kubeconfig" references: [hostman_kubernetes.main (expand) hostman_kubernetes.main hostman_kubernetes.main]
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "hostman_kubernetes.main" references: [var.node_count var.node_type var.kubernetes_version var.availability_zone var.cluster_name]
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "var.node_count" references: []
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "var.hostman_token" references: []
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "output.cluster_id" references: [hostman_kubernetes.main (expand) hostman_kubernetes.main hostman_kubernetes.main]
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "output.cluster_status" references: [hostman_kubernetes.main (expand) hostman_kubernetes.main hostman_kubernetes.main]
2025-06-26T13:00:25.074+0100 [DEBUG] ReferenceTransformer: "provider[\"local/hostman/hostman\"]" references: [var.hostman_token]
2025-06-26T13:00:25.074+0100 [DEBUG] Starting graph walk: walkApply
2025-06-26T13:00:25.074+0100 [DEBUG] created provider logger: level=debug
2025-06-26T13:00:25.074+0100 [INFO]  provider: configuring client automatic mTLS
2025-06-26T13:00:25.088+0100 [DEBUG] provider: starting plugin: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman args=[.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman]
2025-06-26T13:00:25.088+0100 [DEBUG] provider: plugin started: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman pid=50387
2025-06-26T13:00:25.088+0100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman
2025-06-26T13:00:25.092+0100 [INFO]  provider.terraform-provider-hostman: configuring server automatic mTLS: timestamp=2025-06-26T13:00:25.092+0100
2025-06-26T13:00:25.099+0100 [DEBUG] provider: using plugin: version=5
2025-06-26T13:00:25.100+0100 [DEBUG] provider.terraform-provider-hostman: plugin address: address=/tmp/plugin3883295619 network=unix timestamp=2025-06-26T13:00:25.099+0100
hostman_kubernetes.main: Creating...
2025-06-26T13:00:25.115+0100 [INFO]  Starting apply for hostman_kubernetes.main
2025-06-26T13:00:25.115+0100 [DEBUG] hostman_kubernetes.main: applying the planned Create change
2025-06-26T13:00:25.887+0100 [ERROR] provider.terraform-provider-hostman: Response contains error diagnostic: tf_provider_addr=provider tf_rpc=ApplyResourceChange tf_proto_version=5.4 @caller=/home/al/go/pkg/mod/github.com/hashicorp/terraform-plugin-go@v0.19.0/tfprotov5/internal/diag/diagnostics.go:58 @module=sdk.proto diagnostic_detail= diagnostic_severity=ERROR diagnostic_summary="API error (404): 404 page not found" tf_req_id=775a9311-b3c1-cc8f-b1da-e1b0f871f3de tf_resource_type=hostman_kubernetes timestamp=2025-06-26T13:00:25.887+0100
2025-06-26T13:00:25.902+0100 [ERROR] vertex "hostman_kubernetes.main" error: API error (404): 404 page not found
╷
│ Error: API error (404): 404 page not found
│ 
│   with hostman_kubernetes.main,
│   on main.tf line 13, in resource "hostman_kubernetes" "main":
│   13: resource "hostman_kubernetes" "main" {
│ 
╵
2025-06-26T13:00:25.910+0100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2025-06-26T13:00:25.912+0100 [DEBUG] provider: plugin process exited: path=.terraform/providers/local/hostman/hostman/0.1.0/linux_amd64/terraform-provider-hostman pid=50387
2025-06-26T13:00:25.912+0100 [DEBUG] provider: plugin exited
```

Check your code against the API at https://hostman.com/api-docs/#tag/Kubernetes